# Правильные ответы
successful_responses = [
    "Правильно!",
    "Все верно!",
    "Successfully!",
    "Твой ответ верный",
    "Хорошо - правильно",
    "Ты ответил правильно",
    "Ответ принят - все верно",
    "Это был правильный ответ",
]

# Похвальные ответы
praise = [
    "Совершенно верно! Ты многому обучен",
    "Молодец! Хорошо английский знаешь 👍",
    "Замечательные ответы - перевод верный"
]

# Неуспешные ответы
unsuccessful_answers = [
    "Не верно",
    "Неправильно",
    "Перевод выбран не верно",
    "Не верно - ответь ещё раз",
    "Неправильно - попробуй заново",
    "Ты ответил не верно - попробуй ещё раз",
    "Ответ не правильный - выбери верный перевод"
]

# Ответы при слишком большом количестве ошибок
dead_end = [
    "Понимаю слово сложное - меняем слово",
    "Вовсе не правильно. Давай другое слово",
    "Возможно ты такого совсем не знаешь - держи другое",
    "Эх дружок совсем не правильно. Вот тебе другое слово",
]

# Ответы при некорректном вводе
incorrect_input = [
    "Мы такого не знаем",
    "Я такого не понимаю",
    "Моя твоя не понимать",
    "Команда не распознана",
    "Не понимаю что ты хочешь",
    "Я не знаю чего ты от меня хочешь",
    "То что ты написал не распознаётся",
    "Я пока не знаю что и ответить на это",
]